package HomeWork2Lena;

public class Task2 {
    /* Мое имя
Вывести на экран свое имя 5 строк по 10 раз (через пробел).
System.out.println, System.out.print можно использовать только по одному разу
для этого нужно воспользоваться циклом for*/
    public static void main(String[] args) {
        String name = "Lena";
        int string_number = 5;
        int repeat_times = 10;

    }
}
