package HomeWork2Lena;

public class Task1 {
    /*Минимум трех чисел
    Написать функцию, которая вычисляет минимум из трёх чисел.*/
    public static void min(String[] args) {
        int a = 15;
        int b = -8;
        int c = 10;
        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        int l = (a+b)/2 *c;
        System.out.println(l);

    }
}
